[
    [
        {
            "Amazon Product Profile": {
                "Product_ASIN": "B07MW4BR8D",
                "Product_Title": "Stylus Pen for Touch Screens with Magnetic Charging Station Standby 30 Days 1.45mm Copper Tip Digital Pen Compatible with iPhone/iPad/Android/Samsung/Surface/Tablet/Smartphone for Drawing (Sliver)",
                "Product_Price": "$27.99",
                "Product_URL": "https://www.amazon.com/dp/B07MW4BR8D",
                "Product_All_Reviews_URL": "https://www.amazon.com/Heiyo-Magnetic-Rechargeable-Capacitive-Compatible/product-reviews/B07MW4BR8D/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews",
                "Product_Positive_Reviews_URL": "https://www.amazon.com/Heiyo-Magnetic-Rechargeable-Capacitive-Compatible/product-reviews/B07MW4BR8D/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&filterByStar=positive&pageNumber=1",
                "Product_Critical_Reviews_URL": "https://www.amazon.com/Heiyo-Magnetic-Rechargeable-Capacitive-Compatible/product-reviews/B07MW4BR8D/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&filterByStar=critical&pageNumber=1",
                "Product_No_Of_Postivie_Reviewes": "8",
                "Product_No_Of_Critical_Reviewes": "10",
                "Product_Questions_URL": "https://www.amazon.com/ask/questions/asin/B07MW4BR8D/"
            }
        },
        {
            "Amazon Product Reviews": [
                {
                    "Reviewer_Name": "Gabby Anderson",
                    "Review_Title": "Excellent Multi-use Universal Stylus Pen!!",
                    "Review_Rating": "★★★★★",
                    "Review_Date": "15-06-2019",
                    "Review_Text": "Your browser does not support HTML5 video.\n\n\n   I have 2 tablet,  It works with every touch screen I have such as my surface and ipad in video, So far I think this one is the best stylus I've ever purchased. Highly recommend. The fine tip works great on tablet screens and fine detail. It come with a micro-usb charging cord,  the pen top is magnetically attached over charging port. The price is reasonable compared to other stylus.Great Stylus, Perfect For Tablets, you can have a try.",
                    "Review_type": "Positive",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Kevin Fisher",
                    "Review_Title": "Accurate, holds charge!",
                    "Review_Rating": "★★★★★",
                    "Review_Date": "21-04-2019",
                    "Review_Text": "Wow, love this. I had a stylus that was similar but cheaper, it had replaceable tips, but this is sleeker, holds charge longer, and it’s more accurate. The tip is tiny and doesn’t need to be replaced. Super accurate and I love the color. I use it on my first generation iPad and I’m really happy I bought this stylus instead of a cheaper (cheaper made) one. Totally worth it.",
                    "Review_type": "Positive",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "DuxDiva",
                    "Review_Title": "My new favorite appendage.",
                    "Review_Rating": "★★★★★",
                    "Review_Date": "04-01-2020",
                    "Review_Text": "Great product. Nice weight, beautiful color (blue), click top, magnetic charger, everything about it is wonderful. Is great on my iPhone, amazing on iPad Pro, and was surprised that it worked on 3 of our 5 kindle fires (not beautully responsive like on Apple screen, but didn’t expect it to work on them at all). Ordered a similar product right after this to get another color and was not nearly as impressed. Please make more colors!",
                    "Review_type": "Positive",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Joni",
                    "Review_Title": "Love it so far",
                    "Review_Rating": "★★★★★",
                    "Review_Date": "13-06-2020",
                    "Review_Text": "I’ve only had this for a week. So I can’t vouch for its durability. But he works great with my iPad Mini 4. I’m using it mostly for my coloring games as some of the areas are so tiny that my finger would not be able to tap onto the space to fill it. I still have to zoom in some cause it won’t get to super tiny spots, but I think its accuracy is probably identical to that of higher priced pencils.It’s about the same weight of a “good pen” not like a bic pen. LOL! Which makes handling much nicer. Clicks on and off like a pen, and lasts a while if you turn it off between uses. It does not require pairing. Works right out of the box.",
                    "Review_type": "Positive",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Caden Fox",
                    "Review_Title": "Excellent iPad and iPhone stylus pen",
                    "Review_Rating": "★★★★★",
                    "Review_Date": "06-04-2020",
                    "Review_Text": "Fantastic product, it’s easy to charge and compatible with both my Samsung S9 and my iPad.One thing to note is that the pen is quite sensitive, which might annoy some people but it’s great for anyone wanting to write or draw with this pen.This Stylus Pen has saved me a lot of time and effort.",
                    "Review_type": "Positive",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Jonathan",
                    "Review_Title": "Finally a stylus that works great!",
                    "Review_Rating": "★★★★★",
                    "Review_Date": "13-09-2019",
                    "Review_Text": "This is by far the best stylus I've purchased to date. It works with virtually any touch screen and is very accurate. Writing with it is flawless and feels natural. The magnetic charging snaps into place and is the quickest charging I've experienced with any stylus I've own before. It last longer than others I've owned as well. The copper tip is way better than those rubber, disk, or mesh tipped ones and won't degrade or need replacement. Overall this stylus rocks and would highly recommend to anyone looking for a sturdy, well built, and long lasting stylus.",
                    "Review_type": "Positive",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Luc E.",
                    "Review_Title": "Awsome pen and won’t scratch your screen",
                    "Review_Rating": "★★★★★",
                    "Review_Date": "23-12-2020",
                    "Review_Text": "I was a bit hesitant to get this as it said it was a brass or copper tip and was scared it would scratch my new computers screen. But I was wrong. It glides very smoothly, the pen came fully charged , is sleek, and very easy to hold , feels like I’m writing with a pen. I love how reactive it is to the touch screen, and how smooth is travels on the surface of the screen. Very glad I got this one. Also came  with a lifetime warranty wich is really handy to have. If I’m doubt..I would def get this pen. I use it for 3D design and sketching and love it .",
                    "Review_type": "Positive",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Logan Buckner",
                    "Review_Title": "Lightweight and extremely accurate, with no pairing needed",
                    "Review_Rating": "★★★★★",
                    "Review_Date": "02-08-2019",
                    "Review_Text": "One of the genius parts about it is that you can use it straight away; you dont have to pair it with Bluetooth, or download any apps, just charge it and youre good to go. A full charge only takes 60 minutes and then it lasts for ages, and it automatically powers down after 3 minutes to save the charge. I have a Huawei tablet, an iPhone, and a Samsung Galaxy S9 so to be able to use the stylus on each of these devices is incredible, and as Ive said before because no pairing in required, you can just move seamlessly from one to another. To charge it, you just install the magnetic cap and insert a micro USB cable, (which is included).",
                    "Review_type": "Positive",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Jacqueline Smith",
                    "Review_Title": "A puppy's paw would work better.",
                    "Review_Rating": "★",
                    "Review_Date": "27-02-2020",
                    "Review_Text": "Your browser does not support HTML5 video.\n\n\n   Hard tip. Scratches the screen. Trying to draw a straight line looks like Morse code with all the dots and dashes. Note taking is impossible. Delayed response. I had to tap the screen several times before it registered and opened an app or file or whatever. Awful awful awful. The only thing this pen did well was the look and feel. It feels like an actually pen. The clip is nice. You click the top of the pen to activate. The blue light that indicates it's on is nice. But then the pen is utterly useless. Useless. Useless. Utterly useless. I'm so disappointed because it looks so cool. Dang...",
                    "Review_type": "Critical",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Jimmy Phan",
                    "Review_Title": "Decent",
                    "Review_Rating": "★★★",
                    "Review_Date": "14-04-2019",
                    "Review_Text": "Your browser does not support HTML5 video.\n\n\n   I bought this for my surface book 2 and surface pro 3 however the pen function will only work if I use the hand drawing option in ONENOTE. Mainly works like a left click than an actual writing pen, depending on the program you use.PROS:-I bought this pen because of the copper tip. I am praying it holds up better than the soft nib or the plastic hard nibs.-Magnetic charging and doesnt need batteries-looks good with LED-easy on/off buttonCons:- not magnetic on the sides therefore wont stick to the side of my surface. The only magnetic part is the clip and the top but the clip isnt strongly magnetized enough.- the USB wire it came with doesnt work- no eraser or right click button- sometimes lags when I'm trying to select stuff- there were some scratches on it when I got it",
                    "Review_type": "Critical",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Kwan L. Lowe",
                    "Review_Title": "Works OK with Pixel",
                    "Review_Rating": "★★★",
                    "Review_Date": "23-09-2020",
                    "Review_Text": "This sort of works with a Pixel 3XL phone. It registers and can make lines and such, but the tracking is pretty poor and not much better than the $4 stylus I'd used previously. By this I mean that lines are extremely jagged versus the smoother lines I get with a finger or the rubber-nibbed 10-pack pens I've been using.I also tried it on a Lenovo Duet and it was close to unusable. It's not listed as a compatible so not taking off any stars for that, but it is supposedly a USI compatible pen. On the Duet it's not usable. It registers lines and can click items but the tracking is so poor that it's better just to use a finger or a plastic stylus.",
                    "Review_type": "Critical",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Across Bones Photography",
                    "Review_Title": "WARNING: False Item Description, Do Not Buy",
                    "Review_Rating": "★",
                    "Review_Date": "05-06-2020",
                    "Review_Text": "Mine doesn't include a detachable magnetic charging station like described and pictured in the listing. Instead, it's got a magnetic port on the end of a short USB cable which makes charging it a lot more inconvenient. It also means that if I ever lose this stupid one purpose cord, I'll be SoL after the battery dies and need a new stylus. The product works for now, not as well as the other off brand one it's replacing but it's serviceable. If it stops working or if anything weird sticks out, I'll update the review. But for now, if this is what the product is, don't buy it. Literally pick any other one. I wish I did.",
                    "Review_type": "Critical",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Janusz Kowalczyk",
                    "Review_Title": "Stops working 2-3 months like almost all my items from amazon.",
                    "Review_Rating": "★",
                    "Review_Date": "26-09-2019",
                    "Review_Text": "I did like it when it actually worked for about 2 months like every other thing I get from amazon which this crap quality is from China and it’s sickening to have me buy things online and no joke, I don’t remember ordering something that has lasted me more than 4 months as what i’m being is crap as this stylus turns charged but doesn’t do anything on phone screens so if you need a stylus for two months this one is perfect for you.",
                    "Review_type": "Critical",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Amy Lynne",
                    "Review_Title": "Mediocre for notetaking, but definately NOT a drawing pen.",
                    "Review_Rating": "★★★",
                    "Review_Date": "01-07-2019",
                    "Review_Text": "currently using with a Samsung Galaxy Tab s3.Written notes are messy and hard to read unless using the handwriting to text function of this tablet. Drawing is little more than drawing with a finger. No pressure sensitivity, and will not allow perm mode.Used with squid app the only ledgable is the handwritten notes to text.  Overall it does work, but not as described.Will be kept as a back up in case my better option bites the dust, but for half the price, that one has pressure sensitivity and it's easier to control. I wouldn't buy this pen again,but ya live and learn I suppose.",
                    "Review_type": "Critical",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "PianoMan",
                    "Review_Title": "Eh..50/50",
                    "Review_Rating": "★★",
                    "Review_Date": "14-10-2020",
                    "Review_Text": "About 1 in 5 times it simply doesn't work for no apparent reason. Other than that,I like everything else about the device;The design of the stylus, charging method, functionality, aesthetics, and duration of charge vs time to recharge. I have owned my fair share of digital pens/stylus's, and I generally prefer this one to others.Update 10/01/20Dropped it one time on the linoleum.. Completely broken. 🙄",
                    "Review_type": "Critical",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Thomas",
                    "Review_Title": "Looks cool... performs less than desirable",
                    "Review_Rating": "★★",
                    "Review_Date": "19-12-2020",
                    "Review_Text": "Pen looks amazing, and having it with a quick disconnect charger is awesome... just sucks that it is hardly accurate even compared to cheaper stylus’ that you can get for a fraction of the price.  I attempted to use it on an iPhone and a google chrome book, both of which I’d used other pens on that worked fine... I was just enamored by the charging set up for this one and despite how cool it seems, I hardly ever use it thanks to its inability to actually draw or write accurately with my movements.  If you are looking for one just save your money and go with a cheaper one that works.",
                    "Review_type": "Critical",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "Clifton L. Smith",
                    "Review_Title": "It does not work.",
                    "Review_Rating": "★",
                    "Review_Date": "27-12-2019",
                    "Review_Text": "It doesn't work. I have a Windows 10 2 in 1 PC tablet combo and this thing just skips around on the screen. I don't even have a screen protector installed. I am sending it back.",
                    "Review_type": "Critical",
                    "Review_ASIN_": "B07MW4BR8D"
                },
                {
                    "Reviewer_Name": "D. Paquette",
                    "Review_Title": "Does not work with windows in my experience",
                    "Review_Rating": "★★★",
                    "Review_Date": "07-01-2020",
                    "Review_Text": "Unfortunately not as described. The \"if your finger works, this pen works\" is not true. Will not work on my windows capacitive touch screen monitors. Does work on my Chromebook and Android phone, but then again so does the regular stylus for a lot less money. So, while I wanted to LOVE it, I will be returning it as it's claims of working with Windows is unfounded in my experience with three different desktop touch screens.",
                    "Review_type": "Critical",
                    "Review_ASIN_": "B07MW4BR8D"
                }
            ]
        },
        {
            "Amazon Product Questions": [
                {
                    "Question_": "Given that this pen uses a rubber nib at the tip and doesn't connect wirelessly to your device, why does the pen need to be charged?",
                    "Answer_": "dear, it do not any connect, you just touch your iphone or ipad ,it can work.",
                    "Question_ASIN_": "B07MW4BR8D"
                },
                {
                    "Question_": "How is the quality of it?",
                    "Answer_": "Good quality. But the tip is copper. It may scratch the screen over time if you do not have a screen protector.",
                    "Question_ASIN_": "B07MW4BR8D"
                },
                {
                    "Question_": "Will this work for my touch screen HP notebook laptop?",
                    "Answer_": "Ive used this on my ipad, note 8 and touch screen windows 10 laptop with no problem",
                    "Question_ASIN_": "B07MW4BR8D"
                },
                {
                    "Question_": "does this support windows right-click?",
                    "Answer_": "The pen acts the same as your finger, where “left click“ is a tap and “right click” is accessed by long-pressing the pen (or finger) and the menu pops up.",
                    "Question_ASIN_": "B07MW4BR8D"
                },
                {
                    "Question_": "does this work with the hp chromebook x360 14b?",
                    "Answer_": "If it is touchscreen, yes.",
                    "Question_ASIN_": "B07MW4BR8D"
                },
                {
                    "Question_": "Will this stylus work with the nintendo switch? with games like super mario maker and the level editor for ssbu, it would be nice to have a stylus.",
                    "Answer_": "dear, this pen only as a stylus pen, it do not need any connection, as long as your figer can work, this pen can work for your devices.",
                    "Question_ASIN_": "B07MW4BR8D"
                },
                {
                    "Question_": "Will it scratch my screen?",
                    "Answer_": "Over time yes if you do not have a screen protector. The tips is copper.",
                    "Question_ASIN_": "B07MW4BR8D"
                },
                {
                    "Question_": "Is it good for mate 20 pro?",
                    "Answer_": "dear, as long as you rfinger can work for your phone, our stylus pen can work",
                    "Question_ASIN_": "B07MW4BR8D"
                },
                {
                    "Question_": "Is there a warranty on the heiyo stylus pen with magnetic charging station, 30-day standby & 10 hrs using time rechargeable capacitive digital pen com",
                    "Answer_": "don’t know about warranties - always best to directly ask mfg. because that info can change.\nI do know it is a really nice stylus for the price.",
                    "Question_ASIN_": "B07MW4BR8D"
                },
                {
                    "Question_": "Will this stylus pen work with the samsung galaxy tab 3 (9.7)?",
                    "Answer_": "Dear,\nThis iPad pen is designed for iPad series, but we haven't test it on Samsung Galaxy series.\nif you have any question, you can contact with our service team",
                    "Question_ASIN_": "B07MW4BR8D"
                }
            ]
        }
    ]
]